Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Although not being covered in this book but certainly worth mentioning is that Flink also provides support for analytical SQL queries over streams.
zh_cn: 虽然本书中并未涉及，但值得一提的是，Flink还支持基于数据流的分析型SQL查询。

source: Although this means Flink processes some messages twice (before and after the failure), the mechanism still achieves exactly-once state consistency because the state of all operators was reset to a point that had not seen this data yet.
zh_cn: 虽然这意味着Flink会重复处理部分消息，但上述机制仍然可以实现精确一次的状态一致性，因为所有算子的状态都会重置到过去还没有处理过那些数据的时间点。

source: Although we don’t cover it here, Flink also provides support for analytical SQL quer‐ ies over streams.
zh_cn: 虽然本书中没有过多涉及，但值得一提的是，Flink还支持对于数据流的分析型SQL查询。

source: Among other APIs, Cassandra fea‐ tures the Cassandra Query Language (CQL), a SQL-like language to read and write records and create, modify, and delete database objects, such as keyspaces and tables.
zh_cn: 在其他API方面，Cassandra提供了CQL（Cassandra Query Language）。这是一种类SQL语言，可用于读写记录以及创建、修改和删除数据库对象（如键空间和表）。

source: Among other options, it can configure the hostnames and ports of one or more contact points; define load
zh_cn: Cluster的配置选项包括针对一个或多个连接点（contact point）的主机名和端口、

source: An ETL process extracts data from a transactional database, transforms it into a common representation that might include validation, value normalization, encoding, deduplication, and schema trans‐ formation, and finally loads it into the analytical database.
zh_cn: ETL的基本流程是：从事务型数据库中提取数据，将其转换为通用表示形式（可能包含数据验证、数据归一化、编码、去重、Schema转换等工作），最终加载到分析型数据库中。

source: An ETL process extracts data from a transactional database, transforms it into a common representation which might include validation, value normalization, encoding, de-duplication, and schema transformation, and finally loads it into the analytical database.
zh_cn: ETL的基本流程是：从事务型数据库中提取数据，将其转换为通用表示形式（可能包含数据验证、数据归一化、编码、去重、格式转换等工作），最终写入到分析型数据库中

source: An IDE for Java and/or Scala development.
zh_cn: 用于Java/Scala开发的IDE。

source: An alternative is to use an event log to distribute updates.
zh_cn: 另一个替代方案是使用事件日志系统来分发更新。

source: An alternative to log4j is logback and Flink provides default configuration files for this backend as well.
zh_cn: 如果不想用log4j，可将其换为logback。Flink同样为该后端提供了默认的配置文件。

source: An application can be canceled in two ways: with or without a savepoint.
zh_cn: 你可以通过两种方式取消应用：使用或不使用保存点。

source: An application consists of multiple operators.
zh_cn: 每个应用都会包含很多算子，

source: An application is recovered in three steps:
zh_cn: 应用恢复要经过3个步骤：

source: An application is started from an uploaded JAR file using the REST call that is shown in Table 10-10 .
zh_cn: 你可以使用表10-10中的REST调用利用上传的JAR文件启动应用。

source: An application receiving game events would experience a gap when the train goes through a tunnel and network con‐ nection is lost.
zh_cn: 当地铁进入隧道断网时，应用接收游戏事件会经历一段间隙。

source: An application receiving online mobile game events played on the subway would experience a gap when the network connection is lost, but events are buffered in the player’s phone and delivered when the connection is restored
zh_cn: 当地铁进入隧道断网时，应用接收游戏事件会中断一会，此时事件会缓存在玩家手机中，并在网络恢复后发出。

source: An application that aims to provide end-to-end exactly-once guarantees requires spe‐ cial sink connectors.
zh_cn: 应用若想提供端到端的精确一次性保障，需要一些特殊的数据汇连接器。

source: An application with a function that has a queryable state is executed just like any other application.
zh_cn: 具有可查询式状态的函数并不会改变应用的执行方式。

source: An appli‐ cation can recover from a TaskManager failure as long as enough processing slots are on standby to compensate for the lost TaskManager.
zh_cn: 只要有足够多的处理槽随时来接替那些无法工作的TaskManager，应用就可以从TaskManager故障中恢复。

source: An early contributor to Flink, she has worked on its graph processing library, Gelly, and on early versions of the Table API and streaming SQL.
zh_cn: 作为Flink早期的贡献者，她参与了图计算库Gelly以及初期版本Table API和流式SQL的建设工作。

source: An early firing trigger
zh_cn: 可提前触发的触发器

source: An element can be added to zero, one, or multiple windows.
zh_cn: 每个元素可以被加到零个、一个或多个窗口中。

source: An element of the first input will not be joined with an element of the second input even if they are just 1 second apart from each other but assigned to two different windows.
zh_cn: 那么一旦来自两个输入的元素没有被划分到同一窗口，它们就无法Join在一起，即使二者彼此仅相差1秒钟。

source: An embedded execution mode starts Flink applications as a single JVM process which can be used to run and debug Flink jobs within an IDE.
zh_cn: Flink的嵌入式执行模式可将应用以单个JVM进程的方式启动，方便在IDE里运行和调试Flink作业，

source: An event log stores and distributes event streams.
zh_cn: 事件日志负责存储事件流并将其分布式化。

source: An event time window computation will yield the same result no matter how fast the stream is pro‐ cessed or when the events arrive at the operator.
zh_cn: 无论数据流的处理速度如何、事件到达算子的顺序怎样，基于事件时间的窗口都会生成同样的结果。

source: An event-driven application architecture
zh_cn: 事件驱动型应用架构

source: An event-driven application architecture.
zh_cn: 事件驱动型应用架构

source: An event-time window computation will yield the same result no matter how fast the stream is pro‐ cessed or when the events arrive at the operator.
zh_cn: 无论数据流的处理速度如何、事件到达算子的顺序怎样，基于事件时间的窗口都会生成同样的结果。

source: An event-time window triggers when the watermarks declare that all timestamps for a certain time interval have been received.
zh_cn: 只有依靠水位线声明某个时间间隔内所有时间戳都已接收时，事件时间窗口才会触发。

source: An evictor can remove collected elements from the con‐ tents of a window.
zh_cn: 它可以用来从窗口中删除已经收集的元素。

source: An example application would be a real-time monitoring dashboard that displays event aggregates as they are received.
zh_cn: 一个常见示例应用是实时监控仪表盘，它会接收并展示事件聚合结果。

source: An idempotent SinkFunction that writes to a JDBC database
zh_cn: 利用JDBC写数据库的幂等性SinkFunction

source: An idempotent operation can be performed several times but will only result in a sin‐ gle change.
zh_cn: 幂等操作可以多次执行，但只会导致一次改变。

source: An important choice that affects the performance of an application is the state back‐ end that maintains its state.
zh_cn: 影响应用程序性能的一个重要方面是用以维护状态的状态后端的选择。

source: An input split defines a range on a file,
zh_cn: 每个输入划分都定义了文件中的某个范围，

source: An instance of the function class can then be passed as an argument to the filter transformation:
zh_cn: 随后可将函数类的实例作为参数传递给filter转换：

source: An interesting property of watermarks is that they allow an application to control result completeness and latency.
zh_cn: 水位线的意义之一在于它允许应用控制结果的完整性和延迟。

source: An interval join joining two streams A and B
zh_cn: 流A和流B上基于间隔的Join

source: An interval join needs to buffer records from one or both inputs.
zh_cn: 基于间隔的Join需要同时对双流的记录进行缓冲。

source: An iteration of the 2PC protocol succeeds when all sink tasks committed their transactions.
zh_cn: 在全部数据汇任务成功提交自己的事务后，一轮2PC协议的迭代就此结束。

source: An on-going effort of the Flink community is to evolve Flink towards a system with a unified batch and streaming API and runtime.
zh_cn: 社区正在努力的一个方向就是将Flink发展成为在API及运行时层面都能做到批流统一的系统。

source: An ongoing effort of the Flink community is to evolve Flink toward a system with a truly unified batch and streaming API and runtime.
zh_cn: 社区正在努力的一个方向就是将Flink发展成为在API及运行时层面都能做到批流统一的系统。

source: An online retailer is able to recommend products to users while they are browsing on the retailer’s website; mobile games can give virtual gifts to users to keep them in a game or offer in-game purchases at the right moment; manufacturers can monitor the behavior of machines and trigger maintenance actions to reduce production outages.
zh_cn: 在线商家可以在用户浏览店铺页面的同时为其推荐产品；移动游戏为了提高用户粘性可以适时为其发放虚拟礼品或提供内购折扣；制造商可以通过监测机器行为及时触发维护，从而减少生产中断。

source: An operator based on event time uses watermarks to determine the completeness of its ingested records and the progress of its operation.
zh_cn: 基于事件时间的算子使用水位线来判断输入记录的完整度以及自身的操作进度。

source: An operator inherits the slot-sharing group of its input operators if they are
zh_cn: 如果一个算子所有输入都属于同一处理槽共享组，那么该算子也会将这个组继承；

source: An operator pipeline that complies with the requirements of task chaining
zh_cn: 满足任务链接条件的算子流水线

source: An operator pipeline that complies with the requirements of task chaining.
zh_cn: 满足任务链接需求的算子流水线。

source: An operator that is applied on a KeyedStream is applied in the context
zh_cn: 作用在KeyedStream上的算子会同时拥有它的键值定义上下文。

source: An operator that supports recomputing and updating of emitted results needs to pre‐ serve all state required for the computation after the first result was emitted.
zh_cn: 支持重新计算和对已发出结果进行更新的算子需要保留那些用于再次计算结果的状态。

source: An opera‐ tor that is applied on a connected and keyed stream has access to keyed state.3
zh_cn: 作用在已经按照键值分区且已联结的数据流上的算子可以访问键值分区状态。3

source: An optional user scope
zh_cn: 一个可选的用户域

source: An org.apache.flink.metrics.Counter metric measures a count and provides methods for increment and decrement.
zh_cn: org.apache.flink.metrics.Counter指标用于测量计数并提供了相应的增减方法。

source: An unmodified application can always be restarted from its save‐ point.
zh_cn: 如果没有被修改过，应用总是可以从之前生成的保存点重启。

source: Analytical Processing
zh_cn: 分析型处理

source: Analyzing user behavior in mobile applications
zh_cn: 移动应用中的用户行为分析

source: Analyzing user behavior in mobile applications.
zh_cn: 移动应用中的用户行为分析，

source: And everyone knows that the mobile inter‐ net connection in the Berlin subway is lousy.
zh_cn: 而众所周知，柏林地铁上手机网络信号很差。

source: And everyone knows that the mobile internet connection in the Berlin subway is lousy.
zh_cn: 而众所周知，柏林地铁上手机上网信号很差。

source: And how do we even know that data will be delayed?
zh_cn: 此外，我们如何得知数据会产生延迟？

source: And in those cases, will the output be deterministic?
zh_cn: 在上述情况下，结果是否确定？

source: And in those cases, will the out‐ put be deterministic?
zh_cn: 在上述情况下，结果是否确定？

source: And what if a window triggers multiple times?
zh_cn: 再进一步，如果窗口会多次触发计算又该如何处理？

source: Anomaly detection (e.g., to detect attempts to intrude a computer network)
zh_cn: 异常检测（例如：计算机网络入侵检测）。

source: Anomaly detection, e.g., to detect attempts to intrude a computer network.
zh_cn: 异常检测（例如：计算机网络入侵检测）等。

source: Another approach that works for many storage systems is idempotent updates.
zh_cn: 另一种适用于很多存储系统的方法是幂等更新。

source: Another case is when you need to periodically report results in real time, independently of their accuracy.
zh_cn: 另一种情况是，你需要周期性地实时报告结果而无论其准确性如何。

source: Another case is when you need to periodically report results in real-time, independently of their accuracy.
zh_cn: 另一种情况是，你需要周期性地实时报告结果，而不考虑其准确性。

source: Another factor that affects latency and consequently throughput is the time it takes to process an event, or the time it takes for each customer to be served in the coffee shop.
zh_cn: 影响延迟和相应吞吐的另一因素是处理单个事件的时间，即在咖啡店服务每一名顾客所需的时间。

source: Another feature are per-window and per-key global states.
zh_cn: 另一项功能是访问单个窗口的状态及每个键值的全局状态。

source: Another good practice is to update state only once per function call.
zh_cn: 此外我们建议每次函数调用只更新一次状态。

source: Another important aspect of source functions are timestamps and watermarks.
zh_cn: 另一个与数据源函数相关的重要方面是时间戳和水位线。

source: Another improvement was the dissolution of the latency-throughput trade-off.
zh_cn: 系统另一方面的改进是消除了延迟和吞吐的代价权衡。

source: Another improvement was the dissolu‐ tion of the latency/throughput tradeoff.
zh_cn: 它的另一项改进是无需让用户在延迟和吞吐之间做出困难的抉择。

source: Another problem source functions have to deal with are instances that become idle and do not emit anymore data.
zh_cn: 数据源函数要面对的另一个问题是那些空闲下来不再发出数据的实例。

source: Another state backend serializes state objects and puts them into RocksDB, which writes them to local hard disks.
zh_cn: 另一类状态后端会把状态对象序列化后存到RocksDB里面，RocksDB负责将它们写到本地硬盘上。

source: Another technique to reduce the checkpointing algorithm’s impact on the processing latency is to tweak the barrier alignment step.
zh_cn: 我们还可以对分隔符对齐这一步进行调整，以降低检查点算法对处理延迟的影响。

source: Another way to achieve equivalent functionality is using record acknowledgements.
zh_cn: 另一个实现同样功能的途径是启用记录确认。

source: Another way to achieve equivalent functionality is using record acknowledgments.
zh_cn: 还有一个实现同样功能的途径是启用记录确认。

source: Another way to achieve the same result is to hire a second barista and exploit parallelism.
zh_cn: 另一个殊途同归的办法是再雇一个咖啡师，即利用并行解决问题。

source: Another way to achieve the same result is to hire a second barista, that is, to exploit parallelism.
zh_cn: 另一个殊途同归的办法是再雇一个咖啡师，即利用并发解决问题。

source: Another way to define keys and select fields is by using String-based field expres‐ sions.
zh_cn: 另一种定义键值和选择字段的方法是使用基于字符串的字段表达式。

source: Any JVM-based application can query the queryable state of a running Flink applica‐ tion by using QueryableStateClient.
zh_cn: 所有基于JVM的应用都可以使用QueryableStateClient对运行中Flink的可查询式状态进行查询。

source: Any application that processes a stream of events and does not just perform trivial record-at-a-time transformations needs to be stateful, i.e., have the ability to store and access intermediate data.
zh_cn: 任何需要处理事件流的应用程序，如果支持跨多条记录的转换操作，则必须是状态化的，因为需要存储和访问中间结果。

source: Any application that processes a stream of events and does not just perform trivial record-at-a-time transformations needs to be stateful, with the ability to store and
zh_cn: 任何一个处理事件流的应用，如果要支持跨多条记录的转换操作，都必须是状态化的，即能够存储和访问中间结果。

source: Any sink
zh_cn: 任意数据汇

source: Apache Cassandra Sink Connector
zh_cn: Apache Cassandra数据汇连接器

source: Apache Cassandra is a popular, scalable, and highly available column store database system.
zh_cn: Apache Cassandra是一个非常流行的、具有可伸缩和高可用特性的列式存储数据库系统。

source: Apache Flink Web UI home screen
zh_cn: Apache Flink Web UI主界面

source: Apache Flink can be deployed on Kubernetes as well.
zh_cn: Apache Flink也对此做了相应支持。

source: Apache Flink can be easily integrated with Hadoop YARN and HDFS and other com‐ ponents of the Hadoop ecosystem, such as HBase.
zh_cn: Apache Flink可以很容易地与Hadoop YARN、HDFS及其他Hadoop生态组件（如HBase）相集成。

source: Apache Flink checks all these boxes and is a very good choice to run event-driven applications.
zh_cn: Apache Flink 能够同时涵盖上述全部特性，是运行事件驱动型应用的一个非常好的选择。

source: Apache Flink checks all these boxes and is a very good choice to run this class of applications.
zh_cn: Apache Flink能够同时涵盖上述全部特性，是运行该类应用的一个非常好的选择。

source: Apache Flink features a resettable source connector to ingest data in files as streams.
zh_cn: Apache Flink提供了一个可重置的数据源连接器，支持将文件中的数据提取成数据流。

source: Apache Flink features queryable state to address use cases that usually would require an external datastore to share data.
zh_cn: 为了解决通常意义上需要外部数据存储才能分享数据的问题，Apache Flink提供了可查询式状态（queryable state）功能。

source: Apache Flink has a growing and welcoming community with contributors and users all around the world.
zh_cn: Apache Flink拥有一个不断成长的友好社区，其中的贡献者和用户来自全球各地。

source: Apache Flink is a distributed stream processor of the third generation with a compet‐ itive feature set.
zh_cn: Apache Flink是一个集众多具有竞争力的特性于一身的第三代流处理引擎。

source: Apache Flink is a distributed stream processor with intuitive and expressive APIs to implement stateful stream processing applications.
zh_cn: Apache Flink是一个分布式流处理引擎，它提供了直观且极富表达力的API来实现状态化流处理应用，

source: Apache Flink is a third-generation distributed stream processor with a competitive feature set.
zh_cn: Apache Flink是一个集众多具有竞争力的特性于一身的第三代流处理引擎。

source: Apache Flink offers many parameters to configure its behavior and tweak its perfor‐ mance.
zh_cn: Apache Flink提供了很多用来配置行为和调节性能的参数。

source: Apache Flink provides a script to build job-specific Flink Docker images.
zh_cn: Apache Flink提供了一个用于针对特定作业构建Flink Docker镜像的脚本。

source: Apache Flink provides connectors to read data from and write data to a variety of storage systems.
zh_cn: Apache Flink为很多外部存储系统都提供了相应的数据读写连接器。

source: Apache Flink provides the AsyncFunction to mitigate the latency of remote I/O calls.
zh_cn: Apache Flink提供的AsyncFunction可以有效降低I/O调用所带来的延迟。

source: Apache Flink stores application state locally in memory or in an embedded database and not in a remote database.
zh_cn: Apache Flink使用本地内存和嵌入式数据库（而非远程数据库）存储状态。

source: Apache Flink stores the application state locally in memory or in an embedded data‐ base.
zh_cn: Apache Flink使用本地内存和嵌入式数据库存储状态。

source: Apache Flink supports Kerberos authentication and can be configured to encrypt all network communication with SSL.
zh_cn: Apache Flink支持Kerberos身份验证，可以利用SSL对网络通信进行加密。

source: Apache Flink uses filesystems for various tasks.
zh_cn: 文件系统在Apache Flink中用途广泛。

source: Apache Kafka Sink Connector
zh_cn: Apache Kafka数据汇连接器

source: Apache Kafka Source Connector
zh_cn: Apache Kafka数据源连接器

source: Apache Kafka is a distributed streaming platform.
zh_cn: Apache Kafka是一个分布式流处理平台。

source: Apache Maven 3.x.
zh_cn: Apache Maven 3.x版本。

source: Apache Parquet, which organizes and compresses records in a columnar for‐ mat, is a file format that requires bulk encoding.
zh_cn: Apache Parquet会以列式来组织和压缩记录，因此该文件格式需要批量编码。

source: Apart from creating your own histogram implementation, Flink also allows you to use a DropWizard histogram by adding the dependency in the following:
zh_cn: 除了创建你自己的直方图实现外，Flink还允许你通过添加以下依赖使用DropWizard直方图：

source: Apart from having a practical value, windows also enable semantically interesting queries on streams.
zh_cn: 除了产生单个有用的结果，窗口操作还支持在数据流上完成一些语义方面很有价值的查询。

source: Appendix Title.
zh_cn: 附录标题。

source: Application Consistency Guarantees
zh_cn: 应用的一致性保障

source: Application Consistency Guarantees | 185
zh_cn: 应用的一致性保障 | 185

source: Application Deployment
zh_cn: 应用部署

source: Application submission and component interactions
zh_cn: 应用提交及组件交互

source: Application submission and component interactions.
zh_cn: 应用提交及组件交互。

source: ApplicationMaster is YARN’s master process of an application.
zh_cn: ApplicationMaster是YARN中应用的主进程。

source: Applications are usually connected to external services or face human users and con‐ tinuously process incoming events such as orders, email, or clicks on a website.
zh_cn: 这些应用通常会连接外部服务或实际用户，并持续处理诸如订单、邮件、网站点击等传入的数据。

source: Applications can also be individually operated and scaled.
zh_cn: 同时，所有应用都支持独立操作和扩缩容。

source: Applications can be individually operated and scaled.
zh_cn: 同时，全部应用都支持独立操作和扩容。

source: Applications can read their input from and write their results to files (see “Filesystem Source Connector”), application checkpoints and metadata are persisted in remote filesystems for recovery (see “Checkpoints, Savepoints, and State Recovery”), and some internal components lev‐ erage filesystems to distribute data to tasks, such as application JAR files.
zh_cn: 应用可以从文件读取输入或将结果写入文件（请见"文件系统数据源连接器"），应用检查点和元数据会保存在远程文件系统中以供恢复使用（请见"检查点，保存点及状态恢复"），一些内部组件会使用文件系统将数据（例如应用的JAR文件）分发到各任务。

source: Applications consume the results by merging approximated results from the speed table and the accurate results from the batch table.
zh_cn: 为了获取最终结果，应用需要将"提速表"中的近似结果以及批处理表中的精确结果合并。

source: Applications consume the results from the Serving Layer by merging the most recent but only approximated results from the speed table and the older but accurate result from the batch table.
zh_cn: 应用通过合并"提速表"中的较新的近似结果以及批处理表中较旧的精确结果来从服务层获取数据。

source: Applications need to explicitly enable the periodic checkpointing mechanism via the
zh_cn: 应用需要像示例7-9中那样，显式地在StreamExecutionEnvironment中启用周期性检查点机制。

source: Apply Transformations
zh_cn: 应用转换

source: Apply streaming transformations to implement the application logic.
zh_cn: 通过一系列流式转换来实现应用逻辑。

source: Apply transformations
zh_cn: 应用转换操作

source: Applying AsyncFunction on a DataStream
zh_cn: 在DataStream上应用AsyncFunction

source: Applying Functions on Windows
zh_cn: 在窗口上应用函数

source: Applying a CoProcessFunction
zh_cn: 应用CoProcessFunction

source: Applying a FlatMapFunction with a keyed ValueState
zh_cn: 应用一个带有键值分区ValueState的FlatMapFunction

source: Applying a ProcessFunction that emits to a side output
zh_cn: 将数据发送至副输出的ProcessFunction

source: Applying a ReduceFunction for incremental aggregation and a ProcessWindowFunction for finalizing the window result
zh_cn: 使用ReduceFunction执行增量聚合，使用ProcessWindowFunction计算最终结果

source: Applying a reduce lambda function on a WindowedStream
zh_cn: 在WindowedStream上应用reduce lambda函数

source: Applying an AggregateFunction on a WindowedStream
zh_cn: 在WindowedStream上应用AggregateFunction

source: Architecture and Enabling Queryable State
zh_cn: 可查询式状态服务的架构及启用方式

source: Architecture of Flink’s queryable state service
zh_cn: Flink可查询式状态服务的架构

source: Arguably, one could use an external system to also manage streaming state, even though this design choice might introduce additional latency.
zh_cn: 讲道理，虽然可能引入额外延迟，但完全可以同样用一个外部系统来管理流式状态。

source: Arguably, we could use an external system to also manage streaming state, even though this design choice might introduce additional latency.
zh_cn: 按理说，我们也可以使用外部系统来管理流处理过程中的状态，即便这样可能会引入额外延迟。

source: Arrays, Lists, Maps, Enums, and other special types
zh_cn: 数组、列表、映射、枚举以及其他特殊类型

source: As a Windows user you can use the Windows subsystem for Linux (WSL), Cygwin, or a Linux virtual machine to run Flink in a UNIX environ‐ ment.
zh_cn: 如果你是Windows用户，可以使用自带的WSL、Cygwin或Linux虚拟机来在UNIX环境下运行Flink。

source: As a consequence, a single inactive partition causes the whole application to stall because the application’s watermarks do not make progress.
zh_cn: 因此，单个非活跃的分区就会导致整个应用停止运行，因为整个应用的水位线都不会前进。

source: As a consequence, processing systems like Flink need to maintain several dedicated connectors to be able to read events from and write events to the most commonly used message queues, event logs, filesystems, key- value stores, and database systems.
zh_cn: 因此，类似Flink这样的处理系统就需要维护很多专用的连接器，以便能够从最常用的消息队列、事件日志、文件系统、键值存储以及数据库系统中读写事件。

source: As a con‐ sequence, an application with default operator identifiers is very limited in how it can be evolved without losing state.
zh_cn: 因此使用默认算子标识的应用如果不想丢失状态，那么改动空间会比较有限。

source: As described before, transactional sink connectors need to be integrated with Flink’s checkpointing mechanism because they may only commit data to the external system when a checkpoint completes successfully.
zh_cn: 如前所述，由于事务性数据汇连接器可能只会在检查点成功完成后才将数据写入外部系统，所以它需要与Flink的检查点机制做好集成。

source: As described in “Scaling Stateful Operators” on page 56, Flink distributes keyed state on the granularity of so-called key groups.
zh_cn: 我们在第56页"状态化算子扩缩容"一节介绍过，Flink以键值组为单位分配键值状态。

source: As discussed before, Flink requires a sufficient amount of processing slots in order to execute all tasks of an application.
zh_cn: 如前所述，为了执行应用的全部任务，Flink需要足够数量的处理槽。

source: As discussed before, Flink requires a sufficient number of processing slots in order to execute all tasks of an application.
zh_cn: 如前所述，为了执行应用的全部任务，Flink需要足够数量的处理槽。

source: As discussed before, elements are assigned to windows by
zh_cn: 如前所述，元素会通过WindowAssigner分配给窗口，

source: As discussed in “A Quick Look at Flink” on page 12, the program generates read events for multiple thermal sensors, converts the temperature of the events from Fahrenheit to Celsius, and computes the average temperature of each sensor every second.
zh_cn: 我们在第12页"Flink快览"中讲过，这个程序会模拟生成多个热传感器的读数事件，将其中的温度由华氏度改为摄氏度，然后计算每个传感器每秒钟的平均温度。

source: As discussed in “Checkpoints, Savepoints, and State Recovery” on page 58, a check‐ point is only successful if all operator tasks successfully checkpointed their states to the checkpoint storage.
zh_cn: 正如第58页"检查点、保存点及状态恢复"一节所述，在所有算子任务都成功将其状态写入检查点存储后，整体的检查点才算创建成功。

source: As discussed in “Event-Time Processing” on page 47, your application needs to pro‐ vide two important pieces of information to Flink in order to operate in event time.
zh_cn: 我们在第47页"事件时间处理"一节中讲到，为了在事件时间模式下工作，应用需要向Flink提供两项重要信息：

source: As discussed in “Scaling Stateful Operators” on page 56, the list struc‐ ture supports changing the parallelism of functions with operator state.
zh_cn: 其实这个问题的答案已经在第56页"状态化算子扩缩容"中提到了——列表结构允许对使用了算子状态的函数修改并行度。

source: As discussed in “Setting the Parallelism” on page 96, the parallelism of an application and its operators can be specified in different ways.
zh_cn: 我们在第96页"设置并行度"一节介绍过，应用程序及其算子的并行度有多种指定方式。

source: As discussed, the end-to-end consistency guarantees of an application depend on the properties of its sink connectors.
zh_cn: 如前所述，应用端到端的一致性保障取决于其数据汇连接器的属性。
